# GetOrderedFilters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetOrderedFilters Method
View Class See Also
---
Gets the filters applied to the view in the order they are applied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public IList<ElementId> GetOrderedFilters()
```

Visual Basic
---
```text
Public Function GetOrderedFilters As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetOrderedFilters()
```

# ### Return Value
The ElementIds of the Filters.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes. |

# See Also
View Class
Autodesk.Revit.DB Namespace